Autodesk.Revit.DB.Events.DocumentClosedEventArgs.DocumentId
Id of the document that has just been closed.
Remarks:
This Id is only used to identify the document for the duration of this event and the DocumentClosing event which preceded it. It serves as synchronization means for the pair of events.
Since:
2010

Autodesk.Revit.DB.Events.DocumentClosedEventArgs
The event arguments used by the DocumentClosed event.
Since:
2010